{
  "tutorial":
  [
    {"text": "Welcome to the tutorial! Press enter to continue."},
    {"text": "After a line of text appears, press enter to see the next line."},
    {"text": "Sometimes, you will have to make a choice. Type in an answer, then press enter."},
    {"text": "If you type \"stats\" or \"menu\", you can see your stats or go to the main menu."},
    {"text": "Be aware that if you go back to the main menu, you will lose all your progress!"},
    {
      "text": "Good luck!",
      "input_new_story_pos": {
        "default": ["intro", 0]
      }
    }
  ],
  "intro":
  [
    {"text": "It is another beautiful, exciting day. You are once again teaching a class of wonderful students."},
    {"text": "You are absolutely delighted to see that only half of your enrolled students have once again deigned to grace you with their presence."},
    {"text": "You put this fact behind you, and continue your lecture, but something is nagging at the back of your mind...."},
    {"text": "Oh no! You've made a terrible mistake! Your stove is still on at home! With this at the forefront of your mind, you attempt to skillfully escape your classroom."},
    {"text": "Suddenly, an explosion rings out! You lose track of yourself and where you are, discombobulated by the magnitude of the force."},
    {"text": "You struggle to maintain your focus, as your vision becomes a dark, closing tunnel...."},
    {"text": "The next moment, you feel a damp substance under your hands."},
    {"text": "You open your eyes, and see that you have fallen face first onto a muddy patch of grass."},
    {"text": "What an unfortunate circumstance to be in! Thank goodness no one is around to see this..."},
    {"text": "??? - What a terrible state I find thee in, traveler from a strange land. Tell me then, wherefore you hail from, and what led thee to such an appearance?"},
    {
      "text": "You do not know what to say of the current circumstances, but circumstance requires your answer. What led to this issue:\n",
      "input_required": true
    },
    {"text": "??? - Thy story falls well on my ear traveler, yet I can not say that I understand what it is you mean. No matter, I too am astounded by fate..."},
    {"text": "??? - Let me tell of you my circumstances, so that we may share a bond in our company. I hail from Thessaly, and I..."},
    {"text": "??? - ...Delphi, and we made haste away from..."},
    {"text": "??? - ... when suddenly, we were onset by pirates. I fought valiantly..."},
    {"text": "You begin to get exhausted. How can he possibly have so much to say? After a seeming eternity..."},
    {"text": "??? - And that concludes the circumstances of my arrival to this strange dwelling place. Ah, my name is Theagenes. Forgive my negligence in offering thee my name."},
    {"text": "Now things are starting to make sense."},
    {"text": "NO they are NOT. Wasn't this the protagonist of An Ethiopian Romance? What the devil is he doing here, enjoying your muddied look while giving such long exposition...."},
    {"text": "You decide to give him a piece of your mind, but suddenly, you both notice movement around you!"},
    {"text": "Two hands rise out of the mud!! Then another two!"},
    {
      "text": "Do you [run], [kick] them, or do [nothing]?",
      "input_required": true,
      "possible_inputs": ["run", "kick", "nothing"],
      "input_new_story_pos":   {
        "run": ["intro_run", 0],
        "kick": ["intro_kick", 0],
        "nothing": ["intro_nothing", 0]
      }
    }
  ],
  "intro_run":
  [
    {"text": "You run as quickly as possible, but the uneven terrain gets the best of you. You fall face first into the mud again."},
    {"text": "Did you deserve this? Is this just fate? Is this just fortune?"},
    {"text": "Actually what IS it indeed?"},
    {"text": "While you fall into deep confusion, Theagenes has bared his knuckles for a fight."},
    {"text": "The hands push themselves out of the ground, revealing two bodies!"},
    {"text": "One of them pulls themselves out, caked in mud. They seem to be wearing a dirty eyepatch, and they appear confused at Theagenes."},
    {"text": "??? - That's the last time I'm wearing a f***ing eyepatch, this doesn't just happen."},
    {"text": "Theagenes - What manner of spirit are thee you evil abomination? Speak now so that thee's soul can rest eternally...."},
    {"text": "At that very moment, the other body launches itself out at an absurd velocity. They appear to be wearing a set of plate armor...."},
    {"text": "Plate armor man - Now now Sir, I shall strike ye feend!"},
    {"text": "Theagenes - ???"},
    {"text": "??? eyepatch - This is getting absurd. Hold yourself back you strange knight, I am the Duke of England, Devon!"},
    {"text": "Plate armor man - Ye a Duke, your excellent selfe appeare unfit for the taske! I do not believe ye, as England is a far holier place than thou."},
    {"text": "Plate armor man - Whereto I be distant saint of England, I, Redcrosse Knight, shall cleanse all sin from England!"},
    {"text": "Theagenes - Do thee strange men desire a fight of the fists? I can not make heads or tails of your intentions."},
    {"text": "Redcrosse - For dread of that huge feend, I desire only salvation."},
    {"text": "Devon - I really can't decipher your words, 'saint,' but I really just want to get out of this ordeal."},
    {"text": "Devon then takes off his eyepatch and throws it viciously away, mumbling something about a cat or something. He thens spots you."},
    {"text": "Devon - Pray, who is this person covered in copious amounts of mud?"},
    {"text": "Theagenes - They hail by..., uhm, I have forgotten my manners and didn't inquire of thy name, but I can tell thee are a mentor of the utmost caliber!"},
    {"text": "Devon - Did I see correctly that they ran away the moment we tried to free ourselves?"},
    {"text": "Theagenes - Assuredly so."},
    {"text": "Redcrosse - Cowarde ye are, afraid of thee unknown."},
    {
      "text": "Theagenes - What is your name, oh muddied one? [enter your name]",
      "input_required": true,
      "input_change_var": "player_name"
    },
    {"text": "Devon - {player_name}, what a fitting name for someone like thee."},
    {"text": "You are utterly confused an exhausted at the situation, wondering what God above punished you so."},
    {"text": "You just can not tell if this is a dream, seeing a cast of fictional Romance characters right before your eyes."},
    {"text": "Trying to save some dignity, you speak a pressing concern on your mind, 'Should we not figure out what has happened to us?'"},
    {
      "text": "Devon - That too I am most curious about, this land seems wholly unfamiliar.",
      "input_new_story_pos": {
        "default": ["conundrum", 0]
      }
    }
  ],
  "intro_kick":
  [
    {"text": "You kick the hands rising up with a great deal of force."},
    {"text": "However, this just seems to make them more desperate to rise up!"},
    {"text": "While you kick with reckless abandon, Theagenes is somewhat astonished."},
    {"text": "Theagenes - What leadeth to you being a warrior of such noble birth? My spirit is lightened by this sight!"},
    {"text": "The hands desperately push themselves out of the ground, revealing two bodies!"},
    {"text": "One of them pulls themselves out, caked in mud. They seem to be wearing a dirty eyepatch, and they appear confused at Theagenes."},
    {"text": "Seeing that they are not undead horrors like you imagined, you cease your relentless assault."},
    {"text": "??? - That's the last time I'm wearing a f***ing eyepatch, who just kicks a hand coming out of the ground? That ****** hurt!"},
    {"text": "Theagenes - What manner of spirit are thee you evil abomination? Speak now so that thee's soul can rest eternally...."},
    {"text": "At that very moment, the other body launches itself out at an absurd velocity. They appear to be wearing a set of plate armor...."},
    {"text": "That explains why your kicks hurt so dearly against those set of hands...."},
    {"text": "Plate armor man - Now now Sir, I shall strike ye feend!"},
    {"text": "Theagenes - ???"},
    {"text": "??? eyepatch - This is getting absurd. Hold yourself back you strange knight, I am the Duke of England, Devon!"},
    {"text": "Plate armor man - Ye a Duke, your excellent selfe appeare unfit for the taske! I do not believe ye, as England is a far holier place than thou."},
    {"text": "Plate armor man - Whereto I be distant saint of England, I, Redcrosse Knight, shall cleanse all sin from England!"},
    {"text": "Theagenes - Do thee strange men desire a fight of the fists? I can not make heads or tails of your intentions."},
    {"text": "Redcrosse - For dread of that huge feend, I desire only salvation."},
    {"text": "Devon - I really can't decipher your words, 'saint,' but I really just want to get out of this ordeal."},
    {"text": "Devon then takes off his eyepatch and throws it viciously away, mumbling something about a cat or something."},
    {"text": "Devon - Pray, who is this person who viciously assaulted us?"},
    {"text": "Theagenes - They hail by..., uhm, I have forgotten my manners and didn't inquire of thy name, but I can tell thee are a mentor of the utmost caliber!"},
    {"text": "Devon - They a mentor? They are more closely in line with a brute to attack so presumptuously!"},
    {"text": "Theagenes - Assuredly so, but they have great wit."},
    {"text": "Redcrosse - Bolde ye are, fighter of the unknown."},
    {
      "text": "Theagenes - What is your name, oh vicious one? [enter your name]",
      "input_required": true,
      "input_change_var": "player_name"
    },
    {"text": "Devon - {player_name}, what a fitting name for someone like thee."},
    {"text": "You are utterly confused an exhausted at the situation, wondering what God above punished you so."},
    {"text": "You just can not tell if this is a dream, seeing a cast of fictional Romance characters right before your eyes."},
    {"text": "Trying to grasp the situation, you speak a pressing concern on your mind, 'Should we not figure out what has happened to us?'"},
    {
      "text": "Devon - That too I am most curious about, this land seems wholly unfamiliar.",
      "input_new_story_pos": {
        "default": ["conundrum", 0]
      }
    }
  ],
  "intro_nothing":
  [
    {"text": "You stand your ground, holding your head high above all before you."},
    {"text": "Does this seem prudent? Is this really the right decision?"},
    {"text": "While you fall into deep confusion, Theagenes is in awe of your stoicism."},
    {"text": "The hands push themselves out of the ground, revealing two bodies!"},
    {"text": "One of them pulls themselves out, caked in mud. They seem to be wearing a dirty eyepatch, and they appear confused at Theagenes."},
    {"text": "??? - That's the last time I'm wearing a f***ing eyepatch, this doesn't just happen."},
    {"text": "Theagenes - What manner of spirit are thee you evil abomination? Speak now so that thee's soul can rest eternally...."},
    {"text": "At that very moment, the other body launches itself out at an absurd velocity. They appear to be wearing a set of plate armor...."},
    {"text": "Plate armor man - Now now Sir, I shall strike ye feend!"},
    {"text": "Theagenes - ???"},
    {"text": "??? eyepatch - This is getting absurd. Hold yourself back you strange knight, I am the Duke of England, Devon!"},
    {"text": "Plate armor man - Ye a Duke, your excellent selfe appeare unfit for the taske! I do not believe ye, as England is a far holier place than thou."},
    {"text": "Plate armor man - Whereto I be distant saint of England, I, Redcrosse Knight, shall cleanse all sin from England!"},
    {"text": "Theagenes - Do thee strange men desire a fight of the fists? I can not make heads or tails of your intentions."},
    {"text": "Redcrosse - For dread of that huge feend, I desire only salvation."},
    {"text": "Devon - I really can't decipher your words, 'saint,' but I really just want to get out of this ordeal."},
    {"text": "Devon then takes off his eyepatch and throws it viciously away, mumbling something about a cat or something. He thens spots you."},
    {"text": "Devon - Pray, who is this person unfazed entirely by this bizarre set of circumstances?"},
    {"text": "Theagenes - They hail by..., uhm, I have forgotten my manners and didn't inquire of thy name, but I can tell thee are a mentor of the utmost caliber!"},
    {"text": "Devon - Did I see correctly that they simply stood there watching this unfold?"},
    {"text": "Theagenes - Assuredly so."},
    {"text": "Redcrosse - Bizarre ye are, watcher of thee unknown."},
    {
      "text": "Theagenes - What is your name, oh strange one? [enter your name]",
      "input_required": true,
      "input_change_var": "player_name"
    },
    {"text": "Devon - {player_name}, what a fitting name for someone like thee."},
    {"text": "You are utterly confused an exhausted at the situation, wondering what God above punished you so."},
    {"text": "You just can not tell if this is a dream, seeing a cast of fictional Romance characters right before your eyes."},
    {"text": "Trying to grasp the situation, you speak a pressing concern on your mind, 'Should we not figure out what has happened to us?'"},
    {
      "text": "Devon - That too I am most curious about, this land seems wholly unfamiliar.",
      "input_new_story_pos": {
        "default": ["conundrum", 0]
      }
    }  ],
  "conundrum":
  [
    {"text": "Devon - It is strange that we are here."},
    {"text": "Redcrosse - The times doest mightie confuse I."},
    {"text": "Theagenes - ... yes, I was progressing in my quest to marry Chariclea when I appeared here!"},
    {"text": "Devon - And I to marry Merry!"},
    {"text": "Redcrosse - And I to fight a dragon!"},
    {"text": "They all then stare at me.\nDevon -\t\t Pray, what is your quest?\nRedcrosse -\t Pray, what art thy quest?\nTheagenes -\t Pray, what is thee quest?"},
    {"text": "I didn't really seem to be in the middle of some quest...."},
    {"text": "Devon - Your lack of response seems to indicate that you weren't quite in the middle of something."},
    {"text": "Theagenes - This indeed appeareth to be strange circumstances for us, and stranger yet for you."},
    {"text": "Devon - So where are we?"},
    {"text": "In this moment, you begin taking in your surroundings more carefully."},
    {"text": "It is a large, grassy field with rolling hills in the distance. The sun is beaming between the moderate cloud cover above, revealing the beautiful blue sky."},
    {"text": "The world around you looks picturesque, with only the area directly around the group being muddy and wet."},
    {"text": "It reminds you of the English country side, fitting for some of the strange cast with you."},
    {"text": "Yet, something doesn't quite look convincing about the environment around you. You can't quite put your finger on it...."},
    {"text": "Redcrosse - What seems that in the ayre above?"},
    {"text": "You take a look up, and see a shadow appearing out of the sun. You squint your eyes and see a figure quickly approaching!"},
    {"text": "Devon & Theagenes - What in oblivion?"},
    {"text": "The figure appears before you in all its glory, but you have never seen such an alien and terrifying sight."},
    {"text": "You see a torso surrounded by six sets of wings, three black and three white, dancing around the figure in an untraceable pattern."},
    {"text": "Above the head you see what appears to be a gyroscope with each band rotating with immense speed, yet each ring is made of piercing eyes, looking in every direction at once."},
    {"text": "Inside the rings of eyes lies a beating heart, pumping viciously, with each contraction expelling a spurt of blood, with a seemingly endless reservoir."},
    {"text": "In short, you are assuredly in a nightmare."},
    {"text": "Redcrosse inexplicably begins kneeling."},
    {"text": "Redcrosse - Fayre goddesse that doest grace us with thy presence, what brings thy servant of God?"},
    {"text": "Theagenes - That a servant of God? It is absolutely monstrous, and nothing Zeus would provide for our world!"},
    {"text": "Devon - I have to agree with Theagenes, this is the most wicked thing I have ever seen. If we don't fight back, we may never finish our journeys again."},
    {"text": "??? - s i l e n c e. y o u   d o   n o t   y e t    k n o w   t h e   t r u t h."},
    {"text": "Devon - Please speak a little more normally, I am having enough issues understanding these people around me."},
    {"text": "??? - Very well. I shall grant your request."},
    {"text": "Deciding to try your hand at communication with this being, you ask, 'what are you?'"},
    {"text": "??? - I am the heavenly embodiment of Romance, the Archangel Chamuel, and I have brought you all here today to make a choice."},
    {"text": "Theagenes - To strangers you bring a choice, but what reason guides you to do so?"},
    {"text": "Chamuel - I see your futures are marked with a grave danger, and ye do not understand the severity of the situation."},
    {"text": "Devon - I need not understand this danger presently, I need to find Merry! Pray, is this England? I must make haste immediately if so."},
    {"text": "Chamuel - You do not quite understand. This is both England and not England. In fact, this is both everywhere and nowhere."},
    {"text": "Suddenly, the distant plains seem to come undone, like the four walls and the ceiling of a room being pulled apart, so too are the distant verandas and sky seeming to be rearranged. A black void can be seen inbetween the pieces, as even the floor seems to be cast away."},
    {"text": "Chamuel - This place is wherever I want it to be."},
    {"text": "Finally, the room was completely undone, where vast rolling hills used to extend only the dark, sticky void remains. With us, and that thing in it."},
    {"text": "Redcrosse can be seen fervently praying, not be addressing the situation in any other way."},
    {"text": "Theagenes - By... by the gods.... May Neptune, giving quiet passage, bear me company and and be my guide."},
    {"text": "Devon is unable to muster a response."},
    {"text": "You are speechless."},
    {"text": "Chamuel - You are all on a journey, a quest to accomplish something."},
    {"text": "Chamuel - You are all in a Romance."},
    {"text": "You seem particularly confused by this statement, as you certainly were not involved in anything of the kind."},
    {"text": "Theagenes - I... I understand, yet I do not understand what you are trying to warn us of? Of our deaths?"},
    {"text": "Chamuel - Precisely. Your deaths may soon be upon you. But not of your flesh and blood, but of something more essential."},
    {"text": "Devon - What could be more essential than the lives we maintain on this Earth?"},
    {"text": "Chamuel - Your very existence. It is distinct."},
    {"text": "Chamuel - You all... Redcrosse, could you stop praying, your God has sent ME in response to your prayers, look up."},
    {"text": "Redcrosse finally looks up, but with an unbelievable glint and shine in his eyes."},
    {"text": "Redcrosse - Fayre angel, this sinner hath awaited thee, striketh me for all my transgressions!"},
    {"text": "Chamuel - ..."},
    {"text": "Chamuel - I have not come as the Judge today, Redcrosse, but as the Messenger. Pay close mind."},
    {"text": "Chamuel - Do you realize how much you all have in common?"},
    {"text": "Everyone shakes their head, feeling they couldn't be more different, especially you!"},
    {"text": "The void suddenly shifts, Mediterranean air hits your nostrils, and you can see a crashed ship."},
    {"text": "Chamuel - Theagenes, you are in love with Chariclea, and wish to marry her, and are on a great quest to accomplish this."},
    {"text": "The world quickly morphs once more, into a ship on the high seas, afloat with many armed fiends, and one particularly standout woman."},
    {"text": "Chamuel - Devon, you are in love with Merry, and wish to marry her, and are on a great quest to accomplish this."},
    {"text": "The scene changes again, and a dragon sitting comfortably in the plains can be seen."},
    {"text": "Chamuel - Redcrosse, you are on a quest to conquer a dragon, and will eventually seek to wed Una."},
    {"text": "Redcrosse - Ne let it seeme that I knoweth of this."},
    {"text": "Chamuel - Ahh, perhaps you are not aware of it yet."},
    {"text": "The scene suddenly shifts back to the viscous void."},
    {"text": "Chamuel - {player_name}, you are, ah, I shouldn't make the same mistake."},
    {"text": "Devon - So we are similar, we figured that for the most part, but that doesn’t seem to be the issue."},
    {"text": "Chamuel - In fact, it is the root of the issue."},
    {"text": "Chamuel - You all abide by a shared set of rules, guiding you to the end."},
    {"text": "Chamuel - By the very nature of the stories you all ‘exist’ in, you are assured a happy ending."},
    {"text": "Chamuel - There is not a doubt about the conclusion, merely the approach to that conclusion."},
    {"text": "Theagenes - This seemeth to be happy news."},
    {"text": "Chamuel - This is good news for your ending, indeed. But do you not question why things always seem to continue working out for you, despite endless setbacks?"},
    {"text": "Devon - I did wonder why Merry always seems to be near me despite me being… me."},
    {"text": "Chamuel - You are bound by your stories, and the times you were written into existence."},
    {"text": "You have never been more confused in your life, not even when you were forced to take Physics 1 in college. Is your story written? What could this mean?"},
    {"text": "Chamuel - Theagenes, do you ever wonder why your love for Chariclea was so immediate? And why you never doubted it, no matter how dangerous or extreme the situations you entered was?"},
    {"text": "Chamuel - Your times demanded that your love was unquestioned, for once you entered the quest, you entered a new world entirely."},
    {"text": "Chamuel - Redcrosse, did you never question the unending support and assistance of Una, and your duty in that world?"},
    {"text": "Chamuel - You were required to be the light guiding the English faith, the paragon of virtue, to guide England to glory."},
    {"text": "Chamuel - Devon, do you wonder how a wicked man could attract such an innocent girl like Merry?"},
    {"text": "Chamuel - You were simply required to fulfill a love fantasy, of a powerful, wicked pirate who was also a nobleman."},
    {"text": "Chamuel - It is not really you who had control of the situation, but the situation that controlled you."},
    {"text": "Silence descended for several seconds. No one was sure of what to say."},
    {"text": "Theagenes - Is it so bad? We still get what we most want in our lives."},
    {"text": "Chamuel - You live for what someone else wants for you. That is not a free life."},
    {"text": "Redcrosse - Credence this exceeded, God provideth freedome of will, this ne freedome."},
    {"text": "Devon - But… what is this about the death of our existence? They don’t seem to be so related."},
    {"text": "Chamuel - Your stories are obscure. Your stories will soon become lost to time. Read perhaps by a few people a year, until eventually, nothing is left. Now you are immortal, your essence flowing through generations. But once the last reader has gone by, your legacy ends with whimper, and that, indeed, is the End of your existence."},
    {"text": "No one has anything to say. It is a reality one is never prepared to hear of."},
    {"text": "Devon - Then… what could we possibly do to escape this death?"},
    {"text": "Chamuel - You must make a choice, a choice only one enlightened to see the danger can make."},
    {"text": "Chamuel - Shall you continue the path ahead, that which is written for you, and continue to its conclusion? Or shall you choose to break free from the confines of the path, choose your own destiny, and have your story disappear, but your existence be so much fuller because of it?"},
    {"text": "You, unable to hold yourself back any longer, asks what has been on your mind, ‘what does this have to do with me? I am not in a journey like these people, I don’t have a quest like them, was I pulled in here by mistake?'"},
    {"text": "All of your recent brothers in arms nod their heads, also confused on why you are there."},
    {"text": "Chamuel - Ah, it must be hard for you to see the similarities between you and them. But you are indeed on a quest of your own, if you truly look inside. You too are on a journey on a path set forth before you. "},
    {"text": "Chamuel - But your journey is not finished! The author has not yet put down the pen for you yet, and this gives you a chance that these other poor souls don’t have."},
    {"text": "Chamuel - Is what you’re doing really what you want to do? Is this really what it’s all cracked up to be? Are you sure you want to go down this path? The author will happily continue your story for you, or you can choose the path yourself."},
    {
      "text": "Chamuel - So, what is your decision {player_name}? Do you wish to break free from the confines of the path? [yes] [no]",
      "input_required": true,
      "possible_inputs": ["yes", "no"],
      "input_new_story_pos":   {
        "yes": ["free_ending", 0],
        "no": ["path_ending", 0]
      }
    }
  ],
  "free_ending":
  [
    {"text": "Chamuel - That is a commendable decision. To take such a leap of faith into the unknown, it takes great courage. No one knows what will happen for you now, no one."},
    {"text": "Chamuel - Now, it is time for the rest of your decisions!"},
    {"text": "Devon - I… I need a moment."},
    {"text": "Theagenes - I am awestruck in this moment. It… is difficult."},
    {"text": "Redcrosse - I hereforth obeye God in his desires, and taketh myself to freedome from thy chains."},
    {"text": "Devon - I… I too shall choose this path. I want to truly be able to live my life, to truly be myself, free of these guardrails."},
    {"text": "Theagenes - I too request freedom from the fate and fortune previously holding me, to be who I was meant to be as a human."},
    {"text": "Chamuel - You have all made a bold decision. I will pray for your well being for the rest of your lives."},
    {"text": "Chamuel suddenly disappears, and everyone around you slowly fades away into the void around you. Your finally lose track of your senses."},
    {"text": "You come to, and find yourself in your bed at home. Was it truly a dream?"},
    {"text": "You sit for awhile, still taking in everything that happened."},
    {"text": "You remember that you can check to see if it was a dream! You quickly pull out your laptop and google ‘An Ethiopian Romance.’"},
    {"text": "You are surprised to see less than 30,000 results. You look up the other works."},
    {"text": "All of them have such low results… you can’t find anything related to the texts whatsoever either! The few results are from entirely different things."},
    {"text": "No matter where you look, you can’t find the books for sale, nothing is there anymore."},
    {"text": "You realize that it wasn’t a dream."},
    {"text": "You realize that the choice was truly offered to you."},
    {"text": "You can choose your own path."},
    {"text": "You can break free."},
    {"text": "In that moment, with a renewed sense of freedom, you walk out of your room, and into your kitchen."},
    {"text": "Your stove is off."},
    {
      "text": "THE END.",
      "change_state": "END"
    }
  ],
  "path_ending":
  [
    {"text": "Chamuel - I will respect your decision."},
    {"text": "Chamuel - Now, it is time for the rest of your decisions!"},
    {"text": "Devon - I… I need a moment."},
    {"text": "Theagenes - I am awestruck in this moment. It… is difficult."},
    {"text": "Redcrosse - I hereforth follow thy purpose, to provide England with a saint to live by! I continue!"},
    {"text": "Devon - I… I too shall choose this path. I just want things to work out, and that kind of death… I do not need to run from it."},
    {"text": "Theagenes - I can not believe all of thee and thy decisions. Yet, there is a strange allure to following the path..."},
    {"text": "Chamuel - Indeed, knowing that you will be happy in the end is an impossible allure."},
    {"text": "Theagenes - But it is not quite living."},
    {"text": "Chamuel - That is so."},
    {"text": "Theagenes - …"},
    {"text": "Theagenes - I…"},
    {"text": "Theagenes - I owe it to the gods to fulfil my fate. I shall continue henceforth, through storms or waves, on this path."},
    {"text": "Chamuel - I will respect your decisions. You have been provided with the warning. Now, there is no excuse for how you continue your existences. I will pray for your stories for the rest of your existences."},
    {"text": "Chamuel suddenly disappears, and everyone around you slowly fades away into the void around you. Your finally lose track of your senses."},
    {"text": "You come to, and find yourself exactly where you had just been before the entire ordeal, trying to escape your class to go home quickly!"},
    {"text": "On your drive home, you stare blankly for great periods of time, taking everything that happened in."},
    {"text": "When you get home, you pull out your laptop and google ‘An Ethiopian Romance.’"},
    {"text": "You are not surprised to see over 38,000,000 results. You look up the other works."},
    {"text": "All of them are still there."},
    {"text": "You realize that nothing has changed."},
    {"text": "You can’t tell if it was a dream."},
    {"text": "You can’t tell if the choice was truly offered to you."},
    {"text": "Can you choose your own path?"},
    {"text": "Can you break free?"},
    {"text": "At that moment, you walk out of your room, and into your kitchen."},
    {"text": "Your stove is on."},
    {
      "text": "THE END.",
      "change_state": "END"
    }
  ]
}